VIV_cylinder/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh      dynamicMotionSolverFvMesh;

motionSolverLibs ("libsixDoFRigidBodyMotion.so");

motionSolver    sixDoFRigidBodyMotion;

patches         (valec);
innerDistance   0.25;	//in meters
outerDistance   1.09;	//

mass            0.0875;
centreOfMass    (0 0 0);
momentOfInertia (1 1 1);//no rotation anyway
orientation
(
    1 0 0
    0 1 0
    0 0 1
);
angularMomentum (0 0 0);
g               (0 0 0);
rho             rhoInf;
rhoInf          1.205;
report          on;

solver
{
    type symplectic;
}

constraints
{
    yLine
    {
        sixDoFRigidBodyMotionConstraint line;
        centreOfRotation    (0 0 0);
        direction           (0 1 0);
    }

    zAxis
    {
        sixDoFRigidBodyMotionConstraint axis;
        axis                (0 0 1);
    }
}

restraints
{
    verticalSpring
    {
        sixDoFRigidBodyMotionRestraint linearSpring;

        anchor          (0 0 0);
        refAttachmentPt (0 0 0);
        stiffness       21.6;
        damping         0.001;
        restLength      0;
    }

    axialSpring
    {
        sixDoFRigidBodyMotionRestraint linearAxialAngularSpring;

        axis            (0 0 1);
        stiffness       100;
        damping         1;
        referenceOrientation $orientation;
    }
}


// ************************************************************************* //
