VIV_cylinder/0/motionScale
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    location    "0";
    object      motionScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
200120
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
    }
    outlet
    {
        type            calculated;
    }
    top
    {
        type            calculated;
    }
    bottom
    {
        type            calculated;
    }
    valec
    {
        type            calculated;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
