VIV_cylinder/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 4.808;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue
	{
	    type		tableFile;
	    file		"transientBC/INLET_omega";
	}
    }

    outlet
    {
        type            zeroGradient;
    }

    valec
    {
        type            zeroGradient;
    }

    #include "include/frontBackTopBottomPatches"
}


// ************************************************************************* //
